---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DisplacementPathStyle
source: html/7c308f09-353f-277b-a075-96904c2b481a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DisplacementPathStyle Property

"Style"

## Syntax (C#)
```csharp
public static ForgeTypeId DisplacementPathStyle { get; }
```